app/Controllers/JobController.php

    public function display()
    {
        $db = \Config\Database::connect();

        // Join the application, candidate, and job tables
        $query = $db->table('application')
        ->select('application.id as application_id,
                  users.name as candidate_name,
                  users.profile_image,
                  jobpost.type as job_type,
                  jobpost.location as job_location')
        ->join('users', 'application.candidate_id = users.id', 'left')
        ->join('jobpost', 'application.job_id = jobpost.id', 'left')
        ->where('users.user_type', 'candidate')
        ->get();

        $applications = $query->getResultArray();
---
SELECT `application`.`id` as `application_id`, `users`.`name` as `candidate_name`, `users`.`profile_image`, `jobpost`.`type` as `job_type`, `jobpost`.`location` as `job_location`
FROM `application`
LEFT JOIN `users` ON `application`.`candidate_id` = `users`.`id`
LEFT JOIN `jobpost` ON `application`.`job_id` = `jobpost`.`id`
WHERE `users`.`user_type` = 'candidate'
SELECT *
FROM `jobpost`
SELECT *
FROM `users`