app/Controllers/ProfileController.php

    public function profileApi($id)
    {
        // Get the job details based on the ID passed
        $userModel = new ApplicationModel();
        $job = $userModel->find($id); // Find job by ID
---
SELECT *
FROM `users`
WHERE `users`.`id` = '52'
SELECT *
FROM `application`
WHERE `application`.`id` = '56'